<!DOCTYPE html>
<html lang="pt-br">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" href="favicons/download100.jpg" type="image/x-icon">
    <link rel="stylesheet" href="style.css">
    <title>pagina inicial</title>
</head>

<body id="inicial">

    <header>




        <nav>
            <br><br><br><br><br><br><br><br><br><br><br>

            <a class="t1" href="index2.html">CSS</a>
            <a class="t1" href="index3.html">HTML</a>
            <a class="t1" href="index4.html">JAVASCRIPT</a>
            <a class="t1" href="index5.html">PHP</a>
        </nav>

    </header>


    <main class="main1">

        <h1> O que fazem as linguagems de programa&#231;ao web ?? <img src="IMG/imgdoh1.png" alt=""> </h1>

        <p class="ajustedoP"> uma Linguagem de programa&#231;&#227;o web &#233; usadas propriamente para o desenvolvimento do entendido
            como camadas de neg&#243;cio de apresenta&#231;&#227;o, assim como para a constru&#231;&#227;o da l&#243;gica de neg&#243;cios dos websites,
            portais, e aplica&#231;&#245;es web de modo geral. </p>

        <h2 class="h12"> Afinal o que &#233; a programa&#231;&#227;o web ??</h2>

        <p class="ajustedoP">Quando falamos de programa&#231;&#227;o web, a primeira coisa que vem &#224; mente &#233; uma programa&#231;&#227;o de
            sites, certo? </p>

        <p class="ajustep1">A primeira coisa que podemos te dizer &#233; que n&#227;o se trata apenas disso. Imagine que voc&#234; vai
            passar um tempo em outro pa&#237;s em que existem diversos dialetos e para se comunicar com os diferentes povos
            voc&#234; precisar&#225; aprender todos eles. Imaginou?</p>

        <p class="ajustep1"> Bem, com os computadores funciona mais ou menos da mesma maneira. N&#243;s temos que aprender as
            linguagens de programa&#231;&#227;o para que a m&#225;quina responda aos nossos comandos.
            a programa&#231;&#227;o web &#233; justamente esta comunica&#231;&#227;o, que consegue traduzir as informa&#231;&#245;es para que o computador
            interprete e devolva um resultado ao usu&#225;rio final. </p>

        <h3 class="h12">Principais linguagens para programa&#231;&#227;o web</h3>

        <ul>
            <li>HTML <img src="IMG/download23.png" alt="logo" id="ul1"> </li>

        </ul>

        <p class="PdoUL">HTML n&#227;o &#233; propriamente uma linguagem de programa&#231;&#227;o, mas sim de marca&#231;&#227;o. &#201; composta por uma
            esp&#233;cie de pacote de c&#243;digos com regras e normas que definem como ser&#225; exibido cada elemento que comp&#245;e uma
            p&#225;gina que &#233; exibida. </p>




        <ul>
            <li> CSS <img src="IMG/download24.png" alt="logo" id="ul2"> </li>

        </ul>

        <p class="PdoUL"> Juntamente com a HTML, &#233; utilizada para definir o layout da p&#225;gina. &#201; a linguagem que vai
            definir as cores, tipografias, formas, bordas e tudo que for relevante para os conceitos est&#233;ticos de um
            website. </p>





        <ul>
            <li> Javascript <img src="IMG/download25.jpg" alt="logo" id="ul3"> </li>

        </ul>

        <p class="PdoUL">Javascript &#233; uma das principais linguagens de programa&#231;&#227;o utilizadas para programar os scripts
            executados no navegador do usu&#225;rio sempre que ele acessa um site. Ou seja, &#233; a respons&#225;vel pelas intera&#231;&#245;es
            e comportamento dos elementos dentro da p&#225;gina, tornando os processos ali contidos em uma experi&#234;ncia com
            melhor fluidez e dinamismo. </p>






        <ul>
            <li> PHP <img src="IMG/download28.png" alt="logo" id="ul4"> </li>

        </ul>

        <p class="PdoUL"> Este &#233; um dos tipos de linguagem de script em que, geralmente, o c&#243;digo &#233; inserido ou embutido
            no pr&#243;prio HTML. &#201; usada para que, em casos como esse, o c&#243;digo seja executado apenas do lado do servidor e
            passado para o cliente final apenas como um HTML puro, possibilitando uma intera&#231;&#227;o com banco de dados sem
            que fique exposto.

            &#201; ideal para a implementa&#231;&#227;o de fun&#231;&#245;es mais din&#226;micas e complexas dentro de websites e aplica&#231;&#245;es Web. </p>






    </main>



    <footer class="edit2">
        <p> Site referente a avalia&#231;&#227;o da unidade1 </p>
    </footer>




</body>

</html>