<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" href="favicons/download103.png" type="image/x-icon">
    <link rel="stylesheet" href="style.css">
    <title>PHP</title>
</head>

<body id="pag5">

    <header id="php">




        <nav>
            <br><br><br><br><br><br><br><br><br><br><br>


            <a class="t1" href="index.html">p&#225;gina inicial</a>
            <a class="t1" href="index2.html">CSS</a>
            <a class="t1" href="index3.html">HTML</a>
            <a class="t1" href="index4.html">JAVASCRIPT</a>

        </nav>

    </header>


    <main class="main1">

        <h1> O que &#233; o PHP ?? <img src="IMG/download60.jpg" alt="" id="a100"> </h1>

        <p class="ajustedoP">PHP &#233; um acr&#244;nimo recursivo para PHP: Hypertext Preprocessor (Pr&#233;-Processador de
            Hipertexto), que originalmente se chamava Personal Home Page (P&#225;gina Inicial Pessoal).

            Ele tamb&#233;m &#233; um subconjunto de linguagens de scripts como JavaScript e Python. A diferen&#231;a &#233; que PHP costuma
            ser mais usado para comunica&#231;&#227;o do lado do servidor (back-end). Uma linguagem de script serve para
            automatizar a execu&#231;&#227;o de tarefas num ambiente de tempo de execu&#231;&#227;o especial. Isso inclui dizer para uma
            p&#225;gina est&#225;tica (constru&#237;da com HTML e CSS) para executar a&#231;&#245;es espec&#237;ficas com regras que voc&#234; definiu
            anteriormente.

            Por exemplo, voc&#234; pode usar um script para validar uma forma de garantir que todos os campos de um
            formul&#225;rio foram preenchidos antes que eles sejam enviados de volta para o servidor.

            O script, ent&#227;o, iria rodar e checar todos os campos quando um usu&#225;rio enviar o formul&#225;rio. Se um deles
            estiver vazio, um texto de alerta seria exibido para informar o usu&#225;rio disso.

            Outros usos comuns de linguagens de script incluem mostrar um efeito de menu drop-down quando o cursor do
            mouse &#233; passado sobre o menu principal, exibir bot&#245;es de rolagem e anima&#231;&#245;es, abrir caixas de di&#225;logo, e
            assim em diante.</p>




        <h2 class="phpp"> Lado do Servidor (backend) e Lado do Cliente (frontend) </h2>

        <p class="ajustedoP">Linguagens de script podem rodar tanto do lado do servidor (backend) quanto do lado do
            cliente (frontend).

            Scripts do tipo frontend s&#227;o processados pelos navegadores. Quando o seu browser &#8211; tamb&#233;m conhecido como o
            cliente &#8211; solicita uma p&#225;gina contendo scripts do lado do cliente, o servidor responde enviando os
            c&#243;digos-fontes que s&#227;o execut&#225;veis pelo navegador.

            Por outro lado, linguagem de scripts do tipo backend significam que esses scripts s&#227;o executados nos
            servidores antes de serem enviados ao navegador. Ent&#227;o ao inv&#233;s de mandar o c&#243;digo-fonte, os servidores da
            web processam (parse) os c&#243;digos antes ao transform&#225;-los num formato HTML puro.

        </p>

        <h2 class="phpp"> Por Que Usar PHP?
        </h2>


        <p class="ajustep1" style="padding: 20px 0px 20px 0px ;">PHP n&#227;o &#233; a &#250;nica linguagem de script server-side
            dispon&#237;vel &#8211; existem muitas outras dispon&#237;veis. Entretanto, ela tem uma vantagem sobre seus competidores se
            voc&#234; est&#225; rodando um site WordPress.

            Como mencionamos anteriormente, o WordPress &#233; constru&#237;do usando PHP. Ent&#227;o ao usar essa linguagem, ele pode
            aumentar drasticamente a quantidade de customiza&#231;&#227;o que voc&#234; pode ter no seu site.

            Voc&#234; pode us&#225;-lo para modificar os plugins e temas dispon&#237;veis ou at&#233; mesmo criar o seu pr&#243;prio. Se voc&#234;
            quer se tornar um desenvolvedor WordPress, aprender PHP &#233; uma obriga&#231;&#227;o.</p>

        <p class="ajustep1"> Bem, com os computadores funciona mais ou menos da mesma maneira. N&#243;s temos que aprender as
            linguagens de programa&#231;&#227;o para que a m&#225;quina responda aos nossos comandos.
            a programa&#231;&#227;o web &#233; justamente esta comunica&#231;&#227;o, que consegue traduzir as informa&#231;&#245;es para que o computador
            interprete e devolva um resultado ao usu&#225;rio final. falando em scripts, com o PHP voc&#234; pode criar um script
            e utiliz&#225;-lo sem a necessidade de ter um navegador. Voc&#234; precisa somente do interpretador. Essa fun&#231;&#227;o &#233;
            muito &#250;til para programadores que desejam executar o script para cria&#231;&#227;o de APIs. O recurso &#233; chamado de
            execu&#231;&#227;o de script via linha de comando.

            Voc&#234; tamb&#233;m pode criar aplica&#231;&#245;es para desktop. N&#227;o &#233; muito comum, mas se voc&#234; &#233; um programador que gosta de
            desafios, conseguir&#225; utilizar os servi&#231;os mais avan&#231;ados. Para fazer isso, voc&#234; precisa utilizar o PHP-GTK,
            uma extens&#227;o do PHP que vai te ajudar a criar essas aplica&#231;&#245;es. </p>
        <h3 class="phpp"> Exemplo de Startups que ultilizam do PHP </h3>

        <p class="ajustep1" style="padding: 20px 0px 0px 0px ;"> Como exemplos de Startups que utilizam PHP temos o
            Facebook a Slack o Lyft o Bitpanda tambem a delivery hero e a Tesla entre muitos outros </p>





    </main>



</body>

</html>