<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" href="favicons/download102.png" type="image/x-icon">
    <link rel="stylesheet" href="style.css">
    <title>Javascript</title>
</head>

<body id="pag4">

    <header id="javas">




        <nav>
            <br><br><br><br><br><br><br><br><br><br><br>

            <a class="t1" href="index.html">p&#225;gina inicial</a>
            <a class="t1" href="index2.html">CSS</a>
            <a class="t1" href="index3.html">HTML</a>
            <a class="t1" href="index5.html">PHP</a>
        </nav>

    </header>


    <main class="main1">

        <h1>O que &#233; a linguagem JavaScript?? <img src="IMG/download99.png" alt="" id="p99"> </h1>

        <p class="ajustedoP">N&#227;o importa se voc&#234; est&#225; come&#231;ando sua jornada no mundo da programa&#231;&#227;o agora ou j&#225; tem
            experi&#234;ncia com outras linguagens. Voc&#234; provavelmente j&#225; ouviu falar sobre Javascript.

            Esta que &#233; uma das principais linguagens de programa&#231;&#227;o oferece uma variedade muito grande de frameworks e
            aplica&#231;&#245;es para os mais diversos dispositivos. E, quem domina o Javascript, acaba se tornando um programador
            muito vers&#225;til. Antes de mais nada, vamos deixar claro: Javascript n&#227;o &#233; Java. Apesar da confus&#227;o que as
            pessoas normalmente fazem sobre essas duas linguagens, Java e Javascript n&#227;o possuem nenhuma liga&#231;&#227;o direta
            uma com a outra a n&#227;o ser o java no nome. Tendo isso em mente, vamos para a defini&#231;&#227;o de o que &#233; Javascript.

            O JS ou JavaScript &#233; uma linguagem de programa&#231;&#227;o de alto-n&#237;vel, criada no meio da d&#233;cada de 90, mais
            precisamente em 1996 pelo lend&#225;rio programador Brendan Eich que, al&#233;m de criar o JavaScript, foi tamb&#233;m um
            dos fundadores da Mozilla Corporation</p>



        <h2 class="javap"> Como o JavaScript se diferencia das outras linguagens de programa&#231;&#227;o? </h2>

        <p class="ajustedoP">A linguagem de programa&#231;&#227;o Javascript permite ao desenvolvedor implementar diversos itens
            de alto n&#237;vel de complexidade em p&#225;ginas web, como anima&#231;&#245;es, mapas, gr&#225;ficos ou informa&#231;&#245;es que se
            atualizam em intervalos de tempo padr&#227;o, por exemplo.

            Javascript &#233; a terceira camada do bolo de desenvolvimento web e front-end, junto com HTML, CSS e PHP.

        </p>





        <h2 class="javap"> As vantagens do JavaScript </h2>


        <p class="ajustedoP" style="padding: 15px 0px 0px 0px ;">O JavaScript tem uma s&#233;rie de vantagens que fazem com
            ele seja a melhor escolha entre seus competidores. Especialmente em certos tipos de usos e casos. Abaixo
            est&#227;o apenas alguns dos benef&#237;cios de usar a linguagem JS:</p>
        <br>
        <ol start="1">
            <li>N&#227;o precisa de um conpilador </li>

        </ol>

        <p class="PdoUL">Voc&#234; n&#227;o precisa de um compilador porque os navegadores de internet o interpretam com HTML
        </p>


        <br>

        <ol start="2">
            <li> MAIS FACIL !! </li>

        </ol>

        <p class="PdoUL"> &#201; mais f&#225;cil de aprender do que as outras linguagens de programa&#231;&#227;o </p>


        <br>


        <ol start="3">
            <li> JavaScript possui cliques personalizados </li>

        </ol>

        <p class="PdoUL">Ele pode ser designado a certos elementos de p&#225;ginas de internet ou eventos espec&#237;ficos, como
            cliques e rolagens de mouse personalizados </p>

        <br>
        <ol start="4">
            <li> Sites mais interativos </li>

        </ol>

        <p class="PdoUL">Ele faz com que os sites sejam bem mais interativos e segurem a aten&#231;&#227;o dos visitantes por
            mais tempo, caracter&#237;stica que define a experi&#234;ncia do usu&#225;rio (UX) </p>



        <ol start="5">
            <li>Mais R&#225;pido   </li>

        </ol>

        <p class="PdoUL"> Ele &#233; mais r&#225;pido e mais leve que outras linguagens de programa&#231;&#227;o. </p>






    </main>



</body>

</html>